[{"model": "app_core.profile", "pk": 1, "fields": {"first_name": "Laurent", "last_name": "Djoknoné", "headline": "Data Scientiste", "bio": "Laurent Djoknone est un jeune data scientist et ingénieur logiciel d’origine tchadienne, actuellement en Master 1 Data Science et Modélisation Statistique à l’ISSEA‑CEMAC de Yaoundé. Passionné par l’analyse des données, l’intelligence artificielle et la modélisation économétrique, il combine une formation solide en génie logiciel avec des compétences pratiques en machine learning, deep learning et solutions Big Data. Son approche se caractérise par une volonté de transformer des jeux de données complexes en décisions opérationnelles et en outils analytiques robustes pour le secteur public et privé.", "photo": "profile/Profile.jpeg", "email": "djoknonelaurent@gmail.com", "phone": "+23562188674", "location": "Yaoundé/Cameroun", "linkedin_url": "https://www.linkedin.com/in/laurent-djoknon%C3%A9-9a124325a/", "github_url": "https://github.com/DjoknoneLaurent", "twitter_url": "", "facebook_url": "https://www.facebook.com/laurent.djoknone.2025", "website_url": "", "cv_file": "cv/D_L_CV.pdf", "is_available": true, "updated_at": "2025-12-17T06:58:39.048Z"}}, {"model": "app_skills.skillcategory", "pk": 1, "fields": {"name": "Devops", "order": 0}}, {"model": "app_skills.skillcategory", "pk": 2, "fields": {"name": "Data Science", "order": 0}}, {"model": "app_skills.skillcategory", "pk": 3, "fields": {"name": "Statistique", "order": 0}}, {"model": "app_skills.skill", "pk": 1, "fields": {"name": "Modélisation Statistiqur", "category": 3, "level": 4, "icon": "", "order": 1}}, {"model": "app_skills.skill", "pk": 2, "fields": {"name": "Conception et Developpement des application web", "category": 1, "level": 2, "icon": "", "order": 2}}, {"model": "app_skills.skill", "pk": 3, "fields": {"name": "Developpement et deploiemement des modèles de ML", "category": 2, "level": 2, "icon": "", "order": 1}}, {"model": "app_projects.technology", "pk": 1, "fields": {"name": "Python 3.10+ TensorFlow / Keras OpenCV NumPy Matpl", "slug": "python-310-tensorflow-keras-opencv-numpy-matpl", "color": "#6B7280"}}, {"model": "app_projects.project", "pk": 1, "fields": {"title": "Reconnaissance faciale", "slug": "reconnaissance-faciale", "short_description": "Ce projet vise à concevoir, entraîner et évaluer un modèle de Deep Learning capable de reconnaître automatiquement des visages humains à partir d’images", "description": "Le modèle repose sur une architecture CNN (Convolutional Neural Network) implémentée sous TensorFlow / Keras, avec un pipeline complet allant de la préparation des données à la prédiction finale et à la visualisation des performances.\r\n\r\nObjectifs du projet\r\n\r\nConstruire un jeu de données de visages, structuré par individu.\r\nAppliquer un prétraitement complet (redimensionnement, normalisation, conversion RGB).\r\nMettre en œuvre une augmentation de données (Data Augmentation) pour enrichir l’apprentissage.\r\nConcevoir un modèle CNN régularisé et robuste.\r\nÉvaluer les performances à l’aide de métriques visuelles et quantitatives.\r\nTester le modèle sur des images individuelles et analyser les erreurs via une matrice de confusion.\r\nTechnologies et bibliothèques utilisées\r\n\r\nPython 3.10+ TensorFlow / Keras OpenCV NumPy Matplotlib Scikit-learn TQDM\r\n\r\nPipeline général du projet:\r\n\r\n1-Connexion au Drive et exploration des données\r\n\r\nLes données sont stockées dans Google Drive, sous :\r\n\r\npython base_dir = \"/content/drive/MyDrive/Projet_DeepLearning\"\r\n\r\nChaque sous-dossier du répertoire dataset correspond à une personne (classe).\r\n\r\n2-Prétraitement des images\r\n\r\nConversion BGR → RGB Redimensionnement à 128×128 pixels Normalisation des valeurs de pixels entre 0 et 1 Sauvegarde dans un dossier processed_data/\r\n\r\nOutil principal : OpenCV (cv2)\r\n\r\n3-Chargement et préparation des données\r\n\r\n-Chargement des images depuis processed_data/ -Construction des matrices X (images) et y (étiquettes) -Conversion des étiquettes en one-hot encoding -Séparation 80% / 20% en jeu d’entraînement et de test\r\n\r\nOutil principal : Scikit-learn (train_test_split)\r\n\r\n4-Augmentation des données\r\n\r\nPour renforcer la robustesse du modèle, les images sont augmentées par :\r\n\r\nrotations aléatoires (±20°) translations horizontales/verticales zooms aléatoires retournements horizontaux\r\n\r\nCette étape utilise ImageDataGenerator de Keras pour générer dynamiquement de nouvelles images à chaque époque d’entraînement.\r\n\r\n5-Construction du modèle CNN\r\n\r\nLe réseau de neurones convolutif que nous avons proposé comprend:\r\n\r\nLa première partie du réseau correspond à la phase d’extraction des caractéristiques. Elle débute avec une première couche de convolution 2D comportant 32 filtres de taille 3×3, associée à une régularisation L2 fixée à 0.002. Cette couche est suivie d’une opération de pooling (MaxPooling2D) avec une fenêtre 2×2, qui permet de réduire la dimension spatiale tout en conservant les informations essentielles. Un Dropout de 0.3 est ensuite appliqué pour limiter le risque de surapprentissage en désactivant aléatoirement certains neurones pendant l’entraînement.\r\n\r\nLa deuxième partie approfondit l’apprentissage des caractéristiques avec une deuxième couche de convolution 2D comprenant 64 filtres, toujours accompagnée d’une régularisation L2 de 0.003. Elle est suivie d’un MaxPooling2D (2×2) et d’un Dropout de 0.4, renforçant la capacité du modèle à généraliser sur de nouvelles images.\r\n\r\nLa troisième partie constitue la couche de convolution la plus profonde du réseau. Elle contient 128 filtres de taille 3×3, également régularisés avec L2=0.003, suivis d’un pooling 2×2 et d’un Dropout de 0.5. Cette dernière étape d’extraction permet au modèle de capturer des motifs plus complexes et spécifiques aux visages individuels.\r\n\r\nAprès l’extraction des caractéristiques, le réseau passe à la phase de classification. Les cartes de caractéristiques issues des convolutions sont aplaties (Flatten) puis envoyées dans une couche Dense (fully connected) de 128 neurones. Cette couche est également régularisée par un Dropout de 0.4 pour garantir une meilleure robustesse du modèle. Enfin, la couche de sortie est une couche Dense comportant un nombre de neurones égal au nombre total de classes (num_classes), avec une activation Softmax qui permet de produire des probabilités de prédiction pour chaque individu.\r\n\r\n6-Entraînement du modèle\r\n\r\n-50 époques -Batch size = 32 -Données augmentées à chaque itération -Enregistrement automatique de l’historique (loss, accuracy, etc.)\r\n\r\nLes performances sont visualisées via les courbes :\r\n\r\nPrécision (accuracy) : entraînement vs validation Perte (loss) : entraînement vs validation\r\n\r\n7-Sauvegarde du modèle\r\n\r\nLe modèle entraîné est sauvegardé dans :\r\n\r\n/content/drive/MyDrive/Projet_DeepLearning/modele_visage.h5, Cela permet une réutilisation future sans réentraînement.\r\n\r\n8-Évaluation du modèle\r\n\r\n-Évaluation quantitative :\r\n\r\npython: test_eval = model.evaluate(X_test, y_test, verbose=0)\r\n\r\nSortie : ÉVALUATION DU MODÈLE CNN, Test Loss (fonction de perte): 2.2245, Test Accuracy (précision globale) : 67.57%, Modèle encore faible : pense à ajouter plus de données ou à ajuster les hyperparamètres.\r\n\r\nInterprétation automatique :\r\n\r\nLe modèle final de reconnaissance faciale présente une perte (Test Loss) de 2.2245 et une précision globale (Test Accuracy) de 67.57%. Ces résultats montrent que le modèle a bien appris à reconnaître une partie des visages, mais qu’il reste encore des marges d’amélioration pour mieux généraliser. En d’autres termes, le réseau parvient à identifier correctement environ deux visages sur trois, ce qui est déjà une bonne performance pour une première version construite sur un petit jeu de données.\r\n\r\nTout au long du projet, plusieurs efforts importants ont été fournis pour surmonter les difficultés rencontrées. Nous avons commencé par préparer et nettoyer les données en redimensionnant, convertissant et normalisant toutes les images de manière systématique. Chaque étape du prétraitement a été soigneusement testée et vérifiée visuellement pour s’assurer de la qualité des entrées. Ensuite, un réseau de neurones convolutif (CNN) a été construit à partir de zéro, avec plusieurs couches de convolution, de pooling, de régularisation et de dropout. Des ajustements progressifs ont été réalisés sur la structure du modèle et sur les hyperparamètres afin de stabiliser l’entraînement et d’éviter le surapprentissage.\r\n\r\nMalgré tous ces efforts, certains défis subsistent. Le nombre d’images par personne (environ 20) reste faible et limite la diversité des données (expressions, angles, luminosité…). De plus, les paramètres de régularisation relativement forts (Dropout à 0.5 et L2=0.003). e nombre d’époques (50), bien qu’adéquat pour un plusieurs essais, pourrait être augmenté pour permettre une convergence plus complète du réseau.\r\n\r\nCependant, les résultats obtenus sont encourageants : le modèle a démontré une capacité d’apprentissage réelle et une distinction claire entre plusieurs individus. Cela prouve que l’architecture que nous avons mise en place fonctionne correctement.\r\n\r\nPour améliorer la performance, nous estimons pertinent d’ajouter davantage d’images par classe, d’ajuster les hyperparamètres (Dropout entre 0.3 et 0.4, L2 autour de 0.001), d’utiliser des couches de normalisation (BatchNormalization), ou encore de recourir à des modèles préentraînés comme VGG16, ResNet50 ou MobileNetV2 afin de profiter du transfert d’apprentissage. Ces optimisations nous permettraient d’atteindre une précision supérieure à 90%.\r\n\r\nEn résumé, notre modèle atteint une performance moyenne mais prometteuse (≈67%), tout à fait acceptable pour un prototype académique. Ce projet constitue ainsi une base solide pour des versions futures plus puissantes et plus précises que nous envisageons.\r\n\r\n9-Prédiction sur une image individuelle\r\n\r\nChargement d’une image au hasard :\r\n\r\npython:img = cv2.imread(\"processed_data/DJOKNONE/laurent_3.jpg\")\r\n\r\nLe modèle prédit la classe correspondante et affiche :\r\n\r\nPrédiction : DJOKNONE avec un affichage visuel via matplotlib.\r\n\r\n10-Matrice de confusion\r\n\r\nUne matrice de confusion est générée pour évaluer la performance du modèle par classe individuelle. L’affichage se fait avec ConfusionMatrixDisplay de Scikit-learn.\r\n\r\nPISTE D'AMELIORATION:\r\n\r\nAjouter davantage d’images par individu (≥ 50 par classe).\r\nExplorer des architectures plus profondes (ResNet, VGG16, MobileNet).\r\nOptimiser les hyperparamètres (batch size, learning rate, régularisation).\r\nImplémenter un système de détection automatique de visage avant classification.", "image": "", "github_url": "https://github.com/DjoknoneLaurent/Projet_DeepLearning_MDSMS1_G2", "demo_url": "", "status": "in_progress", "is_featured": true, "order": 1, "created_at": "2025-12-17T07:23:45.845Z", "updated_at": "2025-12-17T07:23:45.845Z", "technologies": [1]}}, {"model": "app_experience.experience", "pk": 1, "fields": {"title": "Stagiare", "company": "MENPC-TCHAD", "company_url": "https://chad.opendataforafrica.org/", "location": "N'DJAMENA/TCHAD", "type": "internship", "description": " Conception et réalisation d’une application d’archivage électronique des documents\r\n Installation des infrastructures informatiques\r\n Résolution des pannes logicielles des personnels", "start_date": "2023-08-17", "end_date": "2023-11-17", "is_current": false, "order": 0}}, {"model": "app_experience.education", "pk": 1, "fields": {"degree": "Licence", "field_of_study": "Génie Logiciel/Developpement web", "institution": "ENASTIC-TCHAD", "institution_url": "https://www.enastic.td/", "location": "N'DJAMENA/TCHAD", "start_date": "2020-12-10", "end_date": "2023-12-10", "is_current": false, "description": "Ma formation en génie logiciel m' a fourni des bases solides en développement d’applications, architecture logicielle et gestion de projets informatiques.", "order": 0}}, {"model": "app_experience.education", "pk": 2, "fields": {"degree": "Master professionnel", "field_of_study": "Statistique/Data Science", "institution": "ISSEA-CEMAC", "institution_url": "https://www.issea-cemac.org/", "location": "Yaoundé/Cameroun", "start_date": "2025-01-06", "end_date": "2026-12-06", "is_current": true, "description": "Laurent approfondit aujourd’hui ses connaissances en statistiques appliquées, apprentissage automatique et modélisation prédictive, avec un intérêt marqué pour les méthodes économétriques et l’analyse multidimensionnelle des données.", "order": 1}}, {"model": "app_blog.category", "pk": 1, "fields": {"name": "Devops", "slug": "devops", "description": "Conception,Développement, déploiement des Logiciels", "order": 0}}, {"model": "app_blog.category", "pk": 2, "fields": {"name": "Data Science", "slug": "data-science", "description": "", "order": 0}}, {"model": "app_blog.category", "pk": 3, "fields": {"name": "Modélisation Statistique", "slug": "modelisation-statistique", "description": "Préparation , analyse des données et modélisation statistique basée sur les données", "order": 1}}, {"model": "app_blog.tag", "pk": 1, "fields": {"name": "Super", "slug": "super"}}, {"model": "app_blog.article", "pk": 1, "fields": {"title": "L’importance de la Data Science dans la prise de décision en Afrique", "slug": "limportance-de-la-data-science-dans-la-prise-de-decision-en-afrique", "excerpt": "Dans un monde où les données sont devenues le nouveau pétrole, la Data Science s’impose comme un levier incontournable pour transformer l’information brute en connaissances exploitables. En Afrique, où les défis socio‑économiques sont multiples, l’analyse statistique et la modélisation prédictive offrent des perspectives inédites pour améliorer la gouvernance, la santé publique et le développement économique.", "content": "La Data Science : un outil stratégique\r\nOptimisation des politiques publiques : Les gouvernements peuvent utiliser les modèles prédictifs pour anticiper les besoins en infrastructures, en éducation ou en santé.\r\n\r\nGestion des risques financiers : Les banques et institutions financières recourent aux algorithmes de machine learning pour évaluer la probabilité de défaut de paiement et sécuriser leurs investissements.\r\n\r\nSanté et épidémiologie : L’analyse des données médicales permet de mieux comprendre les facteurs de risque liés aux maladies comme le VIH/SIDA et d’orienter les campagnes de prévention.\r\n\r\nExemple concret : le cas du VIH/SIDA au Cameroun\r\nUne étude récente menée par des étudiants en Data Science a montré que l’analyse statistique des comportements et des données épidémiologiques peut identifier les populations les plus vulnérables. Ces résultats permettent de cibler les interventions et d’optimiser l’allocation des ressources médicales.\r\n\r\nLes défis à relever\r\nQualité des données : Les bases de données africaines souffrent souvent de lacunes ou d’incohérences.\r\n\r\nManque de compétences spécialisées : La formation en Data Science reste limitée, bien que de plus en plus d’instituts comme l’ISSEA‑CEMAC proposent des cursus adaptés.\r\n\r\nInfrastructure technologique : L’accès aux outils de calcul intensif et aux plateformes Big Data demeure un frein dans plusieurs pays.\r\n\r\nConclusion\r\nLa Data Science n’est pas seulement une discipline académique, c’est un véritable moteur de transformation. En Afrique, elle peut contribuer à relever des défis majeurs et à ouvrir la voie vers un développement durable et inclusif. Investir dans la formation, la qualité des données et les infrastructures est essentiel pour libérer tout le potentiel de cette science.", "cover_image": "blog/covers/644a18b637053fa3709c5ba2_what-is-data-science.jpg", "category": 2, "status": "published", "is_featured": true, "views_count": 3, "reading_time": 1, "created_at": "2025-12-17T07:11:04.770Z", "updated_at": "2025-12-18T23:30:52.823Z", "published_at": "2025-12-17T07:11:00Z", "tags": []}}, {"model": "app_blog.article", "pk": 2, "fields": {"title": "Déterminants multidimensionnels de l’infection par le VIH/SIDA au Cameroun : une analyse typologique et structurelle à partir des données de l’EDS V 2018", "slug": "determinants-multidimensionnels-de-linfection-par-le-vihsida-au-cameroun-une-analyse-typologique-et-structurelle-a-partir-des-donnees-de-leds-v-2018", "excerpt": "Le VIH/SIDA demeure un enjeu majeur de santé publique au Cameroun, avec une prévalence nationale estimée à 2,7 %. Au-delà des chiffres globaux, l’épidémie se caractérise par une forte hétérogénéité territoriale, socio-économique et genrée.Cette étude avait pour ambition d’analyser de manière rigoureuse et multidimensionnelle les déterminants individuels, comportementaux, socio-économiques et structurels associés à l’infection, en mobilisant les données représentatives de l’Enquête Démographique", "content": "Méthodologie\r\nL’approche adoptée combine :\r\n\r\nAnalyses descriptives et bivariées pour explorer les associations simples.\r\n\r\nModélisation logistique multivariée pondérée afin de contrôler les effets structurels et respecter le plan de sondage.\r\n\r\nAnalyse des correspondances multiples (ACM) suivie d’une classification ascendante hiérarchique (CHA) pour dégager des profils typologiques de risque.\r\n\r\nCette démarche intégrée permet de croiser les dimensions individuelles, comportementales et structurelles, et d’obtenir une lecture cohérente des vulnérabilités.\r\n\r\nRésultats principaux\r\n1. Typologie des profils de risque\r\nQuatre classes distinctes ont été identifiées :\r\n\r\nClasse 2 (urbains, instruits, actifs économiquement) : prévalence la plus élevée (4,75 %).\r\n\r\nClasses 1 et 3 (ruraux, défavorisés) : prévalences les plus basses.\r\n\r\nClasse 4 (mixte, transitionnelle) : profil intermédiaire.\r\n\r\nCette distribution contre-intuitive révèle une concentration structurelle du risque dans les groupes favorisés.\r\n\r\n2. Disparités de genre\r\nPrévalence féminine : 3,3 % contre 2,0 % chez les hommes.\r\n\r\nChez les jeunes (15–24 ans), les femmes présentent une prévalence près de quatre fois supérieure (1,2 % contre 0,3 %).\r\n\r\nLe modèle logistique confirme que le fait d’être une femme augmente significativement la probabilité ajustée d’être séropositive, soulignant le rôle des inégalités de genre et du pouvoir de négociation limité.\r\n\r\n3. Hétérogénéité territoriale\r\nRégions de l’Est et du Sud : prévalences supérieures à 5 %.\r\n\r\nExtrême-Nord : effet protecteur remarquable (OR = 0,27), soit une réduction du risque de 73 % par rapport à l’Adamaoua.\r\n\r\nCes contrastes mettent en évidence des foyers épidémiques nécessitant un renforcement des politiques de prévention, et des zones protégées par des facteurs culturels ou démographiques.\r\n\r\n4. Paradoxe socio-économique\r\nContrairement à l’hypothèse intuitive d’une plus forte vulnérabilité des pauvres, les individus du quintile “Riche” présentent un risque ajusté 2,39 fois plus élevé d’être infectés que les plus pauvres. Ce paradoxe souligne l’importance des dynamiques structurelles et des comportements associés aux milieux favorisés.\r\n\r\n5. Facteurs comportementaux\r\nMultiplicité des partenaires sexuels, non-utilisation du préservatif et âge précoce au premier rapport sexuel apparaissent comme déterminants significatifs dans les analyses brutes.\r\n\r\nLeur effet s’atténue dans le modèle global, confirmant que les comportements individuels ne sont que la partie visible d’un dispositif de vulnérabilités plus profondes.\r\n\r\nDiscussion\r\nLes résultats confirment plusieurs hypothèses issues de la littérature :\r\n\r\nL’épidémie est fortement genrée et socialement structurée.\r\n\r\nLes inégalités de genre et les disparités territoriales jouent un rôle déterminant.\r\n\r\nLes comportements individuels doivent être replacés dans un cadre socio-économique et culturel plus large.\r\n\r\nLa concentration du risque dans les classes favorisées interpelle les politiques publiques, qui doivent dépasser l’approche centrée sur la pauvreté pour cibler également les milieux urbains et instruits.\r\n\r\nConclusion\r\nCette étude met en évidence la complexité des déterminants du VIH au Cameroun. L’approche typologique et multivariée révèle une épidémie paradoxale, concentrée dans les groupes favorisés mais toujours marquée par une forte vulnérabilité féminine. Les politiques de prévention doivent être adaptées aux réalités locales, en intégrant les dimensions structurelles, territoriales et de genre.\r\n\r\nSur le plan méthodologique, l’utilisation de modèles pondérés et ajustés au plan de sondage s’avère indispensable pour obtenir des estimations fiables. La courbe ROC du modèle logistique final confirme une capacité discriminante satisfaisante (Wald p < 0,001).", "cover_image": "blog/covers/Copilot_20251219_002800.png", "category": 3, "status": "published", "is_featured": true, "views_count": 3, "reading_time": 2, "created_at": "2025-12-18T23:28:56.754Z", "updated_at": "2025-12-18T23:30:52.818Z", "published_at": "2025-12-18T23:28:47Z", "tags": [1]}}, {"model": "admin.logentry", "pk": 1, "fields": {"action_time": "2025-12-17T06:58:39.048Z", "user": 1, "content_type": 1, "object_id": "1", "object_repr": "Laurent Djoknoné", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 2, "fields": {"action_time": "2025-12-17T07:04:49.855Z", "user": 1, "content_type": 7, "object_id": "1", "object_repr": "Licence - ENASTIC-TCHAD", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 3, "fields": {"action_time": "2025-12-17T07:08:05.161Z", "user": 1, "content_type": 7, "object_id": "2", "object_repr": "Master professionnel - ISSEA-CEMAC", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 4, "fields": {"action_time": "2025-12-17T07:11:04.772Z", "user": 1, "content_type": 11, "object_id": "1", "object_repr": "L’importance de la Data Science dans la prise de décision en Afrique", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 5, "fields": {"action_time": "2025-12-17T07:12:13.234Z", "user": 1, "content_type": 9, "object_id": "1", "object_repr": "Devops", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 6, "fields": {"action_time": "2025-12-17T07:12:47.659Z", "user": 1, "content_type": 11, "object_id": "1", "object_repr": "L’importance de la Data Science dans la prise de décision en Afrique", "action_flag": 2, "change_message": "[{\"changed\": {\"fields\": [\"Cat\\u00e9gorie\"]}}]"}}, {"model": "admin.logentry", "pk": 7, "fields": {"action_time": "2025-12-17T07:13:20.760Z", "user": 1, "content_type": 9, "object_id": "2", "object_repr": "Data Science", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 8, "fields": {"action_time": "2025-12-17T07:13:33.743Z", "user": 1, "content_type": 11, "object_id": "1", "object_repr": "L’importance de la Data Science dans la prise de décision en Afrique", "action_flag": 2, "change_message": "[{\"changed\": {\"fields\": [\"Cat\\u00e9gorie\"]}}]"}}, {"model": "admin.logentry", "pk": 9, "fields": {"action_time": "2025-12-17T07:22:09.521Z", "user": 1, "content_type": 4, "object_id": "1", "object_repr": "Python 3.10+ TensorFlow / Keras OpenCV NumPy Matpl", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 10, "fields": {"action_time": "2025-12-17T07:23:45.850Z", "user": 1, "content_type": 5, "object_id": "1", "object_repr": "Reconnaissance faciale", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 11, "fields": {"action_time": "2025-12-17T07:24:11.121Z", "user": 1, "content_type": 2, "object_id": "1", "object_repr": "Devops", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 12, "fields": {"action_time": "2025-12-17T07:24:25.647Z", "user": 1, "content_type": 2, "object_id": "2", "object_repr": "Data Science", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 13, "fields": {"action_time": "2025-12-17T07:24:52.182Z", "user": 1, "content_type": 2, "object_id": "3", "object_repr": "Statistique", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 14, "fields": {"action_time": "2025-12-17T07:29:27.811Z", "user": 1, "content_type": 8, "object_id": "1", "object_repr": "Stagiare - MENPC-TCHAD", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 15, "fields": {"action_time": "2025-12-17T07:30:37.899Z", "user": 1, "content_type": 3, "object_id": "1", "object_repr": "Modélisation Statistiqur (Statistique)", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 16, "fields": {"action_time": "2025-12-17T07:31:46.330Z", "user": 1, "content_type": 3, "object_id": "2", "object_repr": "Conception et Developpement des application web (Devops)", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 17, "fields": {"action_time": "2025-12-17T07:33:11.089Z", "user": 1, "content_type": 3, "object_id": "3", "object_repr": "Developpement et deploiemement des modèles de ML (Data Science)", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 18, "fields": {"action_time": "2025-12-18T23:25:44.264Z", "user": 1, "content_type": 9, "object_id": "3", "object_repr": "Modélisation Statistique", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 19, "fields": {"action_time": "2025-12-18T23:26:14.409Z", "user": 1, "content_type": 10, "object_id": "1", "object_repr": "Super", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 20, "fields": {"action_time": "2025-12-18T23:28:56.762Z", "user": 1, "content_type": 11, "object_id": "2", "object_repr": "Déterminants multidimensionnels de l’infection par le VIH/SIDA au Cameroun : une analyse typologique et structurelle à partir des données de l’EDS V 2018", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 21, "fields": {"action_time": "2025-12-18T23:30:52.821Z", "user": 1, "content_type": 11, "object_id": "2", "object_repr": "Déterminants multidimensionnels de l’infection par le VIH/SIDA au Cameroun : une analyse typologique et structurelle à partir des données de l’EDS V 2018", "action_flag": 2, "change_message": "[{\"changed\": {\"fields\": [\"Statut\"]}}]"}}, {"model": "admin.logentry", "pk": 22, "fields": {"action_time": "2025-12-18T23:30:52.825Z", "user": 1, "content_type": 11, "object_id": "1", "object_repr": "L’importance de la Data Science dans la prise de décision en Afrique", "action_flag": 2, "change_message": "[{\"changed\": {\"fields\": [\"Statut\"]}}]"}}, {"model": "auth.permission", "pk": 1, "fields": {"name": "Can add Profil", "content_type": 1, "codename": "add_profile"}}, {"model": "auth.permission", "pk": 2, "fields": {"name": "Can change Profil", "content_type": 1, "codename": "change_profile"}}, {"model": "auth.permission", "pk": 3, "fields": {"name": "Can delete Profil", "content_type": 1, "codename": "delete_profile"}}, {"model": "auth.permission", "pk": 4, "fields": {"name": "Can view Profil", "content_type": 1, "codename": "view_profile"}}, {"model": "auth.permission", "pk": 5, "fields": {"name": "Can add Catégorie de compétence", "content_type": 2, "codename": "add_skillcategory"}}, {"model": "auth.permission", "pk": 6, "fields": {"name": "Can change Catégorie de compétence", "content_type": 2, "codename": "change_skillcategory"}}, {"model": "auth.permission", "pk": 7, "fields": {"name": "Can delete Catégorie de compétence", "content_type": 2, "codename": "delete_skillcategory"}}, {"model": "auth.permission", "pk": 8, "fields": {"name": "Can view Catégorie de compétence", "content_type": 2, "codename": "view_skillcategory"}}, {"model": "auth.permission", "pk": 9, "fields": {"name": "Can add Compétence", "content_type": 3, "codename": "add_skill"}}, {"model": "auth.permission", "pk": 10, "fields": {"name": "Can change Compétence", "content_type": 3, "codename": "change_skill"}}, {"model": "auth.permission", "pk": 11, "fields": {"name": "Can delete Compétence", "content_type": 3, "codename": "delete_skill"}}, {"model": "auth.permission", "pk": 12, "fields": {"name": "Can view Compétence", "content_type": 3, "codename": "view_skill"}}, {"model": "auth.permission", "pk": 13, "fields": {"name": "Can add Technologie", "content_type": 4, "codename": "add_technology"}}, {"model": "auth.permission", "pk": 14, "fields": {"name": "Can change Technologie", "content_type": 4, "codename": "change_technology"}}, {"model": "auth.permission", "pk": 15, "fields": {"name": "Can delete Technologie", "content_type": 4, "codename": "delete_technology"}}, {"model": "auth.permission", "pk": 16, "fields": {"name": "Can view Technologie", "content_type": 4, "codename": "view_technology"}}, {"model": "auth.permission", "pk": 17, "fields": {"name": "Can add Projet", "content_type": 5, "codename": "add_project"}}, {"model": "auth.permission", "pk": 18, "fields": {"name": "Can change Projet", "content_type": 5, "codename": "change_project"}}, {"model": "auth.permission", "pk": 19, "fields": {"name": "Can delete Projet", "content_type": 5, "codename": "delete_project"}}, {"model": "auth.permission", "pk": 20, "fields": {"name": "Can view Projet", "content_type": 5, "codename": "view_project"}}, {"model": "auth.permission", "pk": 21, "fields": {"name": "Can add Certification", "content_type": 6, "codename": "add_certification"}}, {"model": "auth.permission", "pk": 22, "fields": {"name": "Can change Certification", "content_type": 6, "codename": "change_certification"}}, {"model": "auth.permission", "pk": 23, "fields": {"name": "Can delete Certification", "content_type": 6, "codename": "delete_certification"}}, {"model": "auth.permission", "pk": 24, "fields": {"name": "Can view Certification", "content_type": 6, "codename": "view_certification"}}, {"model": "auth.permission", "pk": 25, "fields": {"name": "Can add Formation", "content_type": 7, "codename": "add_education"}}, {"model": "auth.permission", "pk": 26, "fields": {"name": "Can change Formation", "content_type": 7, "codename": "change_education"}}, {"model": "auth.permission", "pk": 27, "fields": {"name": "Can delete Formation", "content_type": 7, "codename": "delete_education"}}, {"model": "auth.permission", "pk": 28, "fields": {"name": "Can view Formation", "content_type": 7, "codename": "view_education"}}, {"model": "auth.permission", "pk": 29, "fields": {"name": "Can add Expérience", "content_type": 8, "codename": "add_experience"}}, {"model": "auth.permission", "pk": 30, "fields": {"name": "Can change Expérience", "content_type": 8, "codename": "change_experience"}}, {"model": "auth.permission", "pk": 31, "fields": {"name": "Can delete Expérience", "content_type": 8, "codename": "delete_experience"}}, {"model": "auth.permission", "pk": 32, "fields": {"name": "Can view Expérience", "content_type": 8, "codename": "view_experience"}}, {"model": "auth.permission", "pk": 33, "fields": {"name": "Can add Catégorie", "content_type": 9, "codename": "add_category"}}, {"model": "auth.permission", "pk": 34, "fields": {"name": "Can change Catégorie", "content_type": 9, "codename": "change_category"}}, {"model": "auth.permission", "pk": 35, "fields": {"name": "Can delete Catégorie", "content_type": 9, "codename": "delete_category"}}, {"model": "auth.permission", "pk": 36, "fields": {"name": "Can view Catégorie", "content_type": 9, "codename": "view_category"}}, {"model": "auth.permission", "pk": 37, "fields": {"name": "Can add Tag", "content_type": 10, "codename": "add_tag"}}, {"model": "auth.permission", "pk": 38, "fields": {"name": "Can change Tag", "content_type": 10, "codename": "change_tag"}}, {"model": "auth.permission", "pk": 39, "fields": {"name": "Can delete Tag", "content_type": 10, "codename": "delete_tag"}}, {"model": "auth.permission", "pk": 40, "fields": {"name": "Can view Tag", "content_type": 10, "codename": "view_tag"}}, {"model": "auth.permission", "pk": 41, "fields": {"name": "Can add Article", "content_type": 11, "codename": "add_article"}}, {"model": "auth.permission", "pk": 42, "fields": {"name": "Can change Article", "content_type": 11, "codename": "change_article"}}, {"model": "auth.permission", "pk": 43, "fields": {"name": "Can delete Article", "content_type": 11, "codename": "delete_article"}}, {"model": "auth.permission", "pk": 44, "fields": {"name": "Can view Article", "content_type": 11, "codename": "view_article"}}, {"model": "auth.permission", "pk": 45, "fields": {"name": "Can add log entry", "content_type": 12, "codename": "add_logentry"}}, {"model": "auth.permission", "pk": 46, "fields": {"name": "Can change log entry", "content_type": 12, "codename": "change_logentry"}}, {"model": "auth.permission", "pk": 47, "fields": {"name": "Can delete log entry", "content_type": 12, "codename": "delete_logentry"}}, {"model": "auth.permission", "pk": 48, "fields": {"name": "Can view log entry", "content_type": 12, "codename": "view_logentry"}}, {"model": "auth.permission", "pk": 49, "fields": {"name": "Can add permission", "content_type": 13, "codename": "add_permission"}}, {"model": "auth.permission", "pk": 50, "fields": {"name": "Can change permission", "content_type": 13, "codename": "change_permission"}}, {"model": "auth.permission", "pk": 51, "fields": {"name": "Can delete permission", "content_type": 13, "codename": "delete_permission"}}, {"model": "auth.permission", "pk": 52, "fields": {"name": "Can view permission", "content_type": 13, "codename": "view_permission"}}, {"model": "auth.permission", "pk": 53, "fields": {"name": "Can add group", "content_type": 14, "codename": "add_group"}}, {"model": "auth.permission", "pk": 54, "fields": {"name": "Can change group", "content_type": 14, "codename": "change_group"}}, {"model": "auth.permission", "pk": 55, "fields": {"name": "Can delete group", "content_type": 14, "codename": "delete_group"}}, {"model": "auth.permission", "pk": 56, "fields": {"name": "Can view group", "content_type": 14, "codename": "view_group"}}, {"model": "auth.permission", "pk": 57, "fields": {"name": "Can add user", "content_type": 15, "codename": "add_user"}}, {"model": "auth.permission", "pk": 58, "fields": {"name": "Can change user", "content_type": 15, "codename": "change_user"}}, {"model": "auth.permission", "pk": 59, "fields": {"name": "Can delete user", "content_type": 15, "codename": "delete_user"}}, {"model": "auth.permission", "pk": 60, "fields": {"name": "Can view user", "content_type": 15, "codename": "view_user"}}, {"model": "auth.permission", "pk": 61, "fields": {"name": "Can add content type", "content_type": 16, "codename": "add_contenttype"}}, {"model": "auth.permission", "pk": 62, "fields": {"name": "Can change content type", "content_type": 16, "codename": "change_contenttype"}}, {"model": "auth.permission", "pk": 63, "fields": {"name": "Can delete content type", "content_type": 16, "codename": "delete_contenttype"}}, {"model": "auth.permission", "pk": 64, "fields": {"name": "Can view content type", "content_type": 16, "codename": "view_contenttype"}}, {"model": "auth.permission", "pk": 65, "fields": {"name": "Can add session", "content_type": 17, "codename": "add_session"}}, {"model": "auth.permission", "pk": 66, "fields": {"name": "Can change session", "content_type": 17, "codename": "change_session"}}, {"model": "auth.permission", "pk": 67, "fields": {"name": "Can delete session", "content_type": 17, "codename": "delete_session"}}, {"model": "auth.permission", "pk": 68, "fields": {"name": "Can view session", "content_type": 17, "codename": "view_session"}}, {"model": "auth.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$1000000$2PgTYRJINxvyJ9NSQTg7iD$bknBE7bPmlBkPbNGxKBl30mUx61UxLKKdqkDEhu2E8o=", "last_login": "2025-12-17T06:33:44.977Z", "is_superuser": true, "username": "DjoknoneLaurent", "first_name": "", "last_name": "", "email": "djoknonelaurent@gmail.com", "is_staff": true, "is_active": true, "date_joined": "2025-12-16T23:21:37.543Z", "groups": [], "user_permissions": []}}, {"model": "auth.user", "pk": 2, "fields": {"password": "pbkdf2_sha256$1000000$jyAKBc3FIm8ibeFtmhfotK$lblsyhEZ/XuytdruV21yOrXa1jrH/EasGncY0TSgejM=", "last_login": null, "is_superuser": true, "username": "DjokLaur", "first_name": "", "last_name": "", "email": "djoknonelaurent@gmail.com", "is_staff": true, "is_active": true, "date_joined": "2025-12-30T01:37:24.987Z", "groups": [], "user_permissions": []}}, {"model": "contenttypes.contenttype", "pk": 1, "fields": {"app_label": "app_core", "model": "profile"}}, {"model": "contenttypes.contenttype", "pk": 2, "fields": {"app_label": "app_skills", "model": "skillcategory"}}, {"model": "contenttypes.contenttype", "pk": 3, "fields": {"app_label": "app_skills", "model": "skill"}}, {"model": "contenttypes.contenttype", "pk": 4, "fields": {"app_label": "app_projects", "model": "technology"}}, {"model": "contenttypes.contenttype", "pk": 5, "fields": {"app_label": "app_projects", "model": "project"}}, {"model": "contenttypes.contenttype", "pk": 6, "fields": {"app_label": "app_experience", "model": "certification"}}, {"model": "contenttypes.contenttype", "pk": 7, "fields": {"app_label": "app_experience", "model": "education"}}, {"model": "contenttypes.contenttype", "pk": 8, "fields": {"app_label": "app_experience", "model": "experience"}}, {"model": "contenttypes.contenttype", "pk": 9, "fields": {"app_label": "app_blog", "model": "category"}}, {"model": "contenttypes.contenttype", "pk": 10, "fields": {"app_label": "app_blog", "model": "tag"}}, {"model": "contenttypes.contenttype", "pk": 11, "fields": {"app_label": "app_blog", "model": "article"}}, {"model": "contenttypes.contenttype", "pk": 12, "fields": {"app_label": "admin", "model": "logentry"}}, {"model": "contenttypes.contenttype", "pk": 13, "fields": {"app_label": "auth", "model": "permission"}}, {"model": "contenttypes.contenttype", "pk": 14, "fields": {"app_label": "auth", "model": "group"}}, {"model": "contenttypes.contenttype", "pk": 15, "fields": {"app_label": "auth", "model": "user"}}, {"model": "contenttypes.contenttype", "pk": 16, "fields": {"app_label": "contenttypes", "model": "contenttype"}}, {"model": "contenttypes.contenttype", "pk": 17, "fields": {"app_label": "sessions", "model": "session"}}, {"model": "sessions.session", "pk": "rn8yb8scyxzb3hdx8r72kguzqkgfww9z", "fields": {"session_data": ".eJxVjDsOwjAQBe_iGlnrb2xKes4Q7XpXOIAcKU4qxN0hUgpo38y8lxpxW-u4dVnGidVZGXX63QjLQ9oO-I7tNusyt3WZSO-KPmjX15nleTncv4OKvX5rGTJJAeYIlh3nwbpocrKSUiYCnyAGdLEEE5AMBPHJGWP9gOAzEKr3B8-TNtQ:1vVl6W:hxGR4BR89KR8mMQUtnClfRt5faWIo_ugRROaBfNtxSk", "expire_date": "2025-12-31T06:33:44.981Z"}}]